<a href="https://colab.research.google.com/github/Ds2023/SQL/blob/main/sql_session_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///practice.db

In [4]:
%%sql CREATE TABLE Worker (
	WORKER_ID INT NOT NULL PRIMARY KEY,
	FIRST_NAME TEXT(25),
	LAST_NAME TEXT(25),
	SALARY INT(15),
	JOINING_DATE DATETIME,
	DEPARTMENT TEXT(25)
);

 * sqlite:///practice.db
Done.

[]

In [5]:
%%sql CREATE TABLE Bonus (
	WORKER_REF_ID INT,
	BONUS_AMOUNT INT(10),
	BONUS_DATE DATETIME,
	FOREIGN KEY (WORKER_REF_ID)
		REFERENCES Worker(WORKER_ID)
        ON DELETE CASCADE
);

 * sqlite:///practice.db
Done.

[]

In [6]:
%%sql CREATE TABLE Title (
	WORKER_REF_ID INT,
	WORKER_TITLE CHAR(25),
	AFFECTED_FROM DATETIME,
	FOREIGN KEY (WORKER_REF_ID)
		REFERENCES Worker(WORKER_ID)
        ON DELETE CASCADE
);

 * sqlite:///practice.db
Done.

[]

In [7]:
%%sql INSERT INTO Worker
	(WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) VALUES
		(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
		(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
		(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
		(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
		(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
		(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
		(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
		(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite:///practice.db
8 rows affected.

[]

In [8]:
%%sql INSERT INTO Bonus
	(WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES
		(001, 5000, '16-02-20'),
		(002, 3000, '16-06-11'),
		(003, 4000, '16-02-20'),
		(001, 4500, '16-02-20'),
		(002, 3500, '16-06-11');

 * sqlite:///practice.db
5 rows affected.

[]

In [9]:
%%sql INSERT INTO Title
	(WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES
 (001, 'Manager', '2016-02-20 00:00:00'),
 (002, 'Executive', '2016-06-11 00:00:00'),
 (008, 'Executive', '2016-06-11 00:00:00'),
 (005, 'Manager', '2016-06-11 00:00:00'),
 (004, 'Asst. Manager', '2016-06-11 00:00:00'),
 (007, 'Executive', '2016-06-11 00:00:00'),
 (006, 'Lead', '2016-06-11 00:00:00'),
 (003, 'Lead', '2016-06-11 00:00:00');

 * sqlite:///practice.db
8 rows affected.

[]

In [10]:
%sql SELECT * FROM Worker;

 * sqlite:///practice.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

In [11]:
%sql SELECT * FROM Bonus;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

**Fetching Data**

In [12]:
%sql SELECT * FROM Title;

 * sqlite:///practice.db
Done.

[(1, 'Manager', '2016-02-20 00:00:00'),
 (2, 'Executive', '2016-06-11 00:00:00'),
 (8, 'Executive', '2016-06-11 00:00:00'),
 (5, 'Manager', '2016-06-11 00:00:00'),
 (4, 'Asst. Manager', '2016-06-11 00:00:00'),
 (7, 'Executive', '2016-06-11 00:00:00'),
 (6, 'Lead', '2016-06-11 00:00:00'),
 (3, 'Lead', '2016-06-11 00:00:00')]

In [13]:
# Individual Columns

%sql SELECT WORKER_REF_ID, WORKER_TITLE FROM Title;

 * sqlite:///practice.db
Done.

[(1, 'Manager'),
 (2, 'Executive'),
 (8, 'Executive'),
 (5, 'Manager'),
 (4, 'Asst. Manager'),
 (7, 'Executive'),
 (6, 'Lead'),
 (3, 'Lead')]

In [14]:
# Where Clauses

%sql SELECT * FROM Title where WORKER_TITLE == 'Lead';

 * sqlite:///practice.db
Done.

[(6, 'Lead', '2016-06-11 00:00:00'), (3, 'Lead', '2016-06-11 00:00:00')]

In [16]:
# Ordering By (Descending and Ascending)

%sql SELECT * FROM Bonus ORDER BY BONUS_AMOUNT ASC;

 * sqlite:///practice.db
Done.

[(2, 3000, '16-06-11'),
 (2, 3500, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (1, 5000, '16-02-20')]

In [36]:
%sql SELECT * FROM Worker ORDER BY (JOINING_DATE) DESC;

 * sqlite:///practice.db
Done.

[(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

In [18]:
%sql SELECT * FROM Title;

 * sqlite:///practice.db
Done.

[(1, 'Manager', '2016-02-20 00:00:00'),
 (2, 'Executive', '2016-06-11 00:00:00'),
 (8, 'Executive', '2016-06-11 00:00:00'),
 (5, 'Manager', '2016-06-11 00:00:00'),
 (4, 'Asst. Manager', '2016-06-11 00:00:00'),
 (7, 'Executive', '2016-06-11 00:00:00'),
 (6, 'Lead', '2016-06-11 00:00:00'),
 (3, 'Lead', '2016-06-11 00:00:00')]

In [20]:
# Group BY
# Counting the number of workers in each title

%sql SELECT WORKER_TITLE, COUNT(*) AS "Employees" FROM Title GROUP BY WORKER_TITLE;

 * sqlite:///practice.db
Done.

[('Asst. Manager', 1), ('Executive', 3), ('Lead', 2), ('Manager', 2)]

In [21]:
%sql SELECT * FROM Bonus;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

In [24]:
# Getting the bonus per worker_ref_id

%sql SELECT WORKER_REF_ID, SUM(BONUS_AMOUNT) FROM Bonus GROUP BY WORKER_REF_ID;

 * sqlite:///practice.db
Done.

[(1, 9500), (2, 6500), (3, 4000)]

**Aggragating Data**

In [28]:
%sql SELECT * FROM Worker;

 * sqlite:///practice.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

In [27]:
# Count of rows in a table.

%sql SELECT COUNT(*)  FROM Worker;

 * sqlite:///practice.db
Done.

[(8,)]

In [29]:
%sql SELECT * FROM Bonus;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

In [30]:
# Calculating sum of a particular column

%sql SELECT SUM(BONUS_AMOUNT) FROM Bonus;

 * sqlite:///practice.db
Done.

[(20000,)]

In [39]:
# Totals related to a particular entry

%sql SELECT WORKER_REF_ID, SUM(BONUS_AMOUNT) AS Total_Bonus FROM Bonus GROUP BY WORKER_REF_ID ORDER BY Total_Bonus ASC;

 * sqlite:///practice.db
Done.

[(3, 4000), (2, 6500), (1, 9500)]

In [40]:
# Selecting the min and max values

%sql SELECT MIN(BONUS_AMOUNT) FROM Bonus;

 * sqlite:///practice.db
Done.

[(3000,)]

In [41]:
%sql SELECT MAX(BONUS_AMOUNT) FROM Bonus;

 * sqlite:///practice.db
Done.

[(5000,)]

In [42]:
%sql SELECT AVG(BONUS_AMOUNT) FROM Bonus;

 * sqlite:///practice.db
Done.

[(4000.0,)]

In [43]:
%sql SELECT * FROM Bonus;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

In [45]:
# Selecting the least bonus amount and the corresponding ref_id

%%sql SELECT WORKER_REF_ID, BONUS_AMOUNT as LeastBonusAmount
FROM Bonus
WHERE BONUS_AMOUNT = (SELECT MIN(BONUS_AMOUNT) FROM Bonus);

 * sqlite:///practice.db
Done.

[(2, 3000)]

# **JOINS**

![image.png]()

In [47]:
%sql SELECT * FROM Bonus;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02-20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

In [48]:
%sql SELECT * FROM Title;

 * sqlite:///practice.db
Done.

[(1, 'Manager', '2016-02-20 00:00:00'),
 (2, 'Executive', '2016-06-11 00:00:00'),
 (8, 'Executive', '2016-06-11 00:00:00'),
 (5, 'Manager', '2016-06-11 00:00:00'),
 (4, 'Asst. Manager', '2016-06-11 00:00:00'),
 (7, 'Executive', '2016-06-11 00:00:00'),
 (6, 'Lead', '2016-06-11 00:00:00'),
 (3, 'Lead', '2016-06-11 00:00:00')]

In [49]:
%sql SELECT * FROM Worker;

 * sqlite:///practice.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

**Left Join**

This join returns all the rows of the table on the left side of the join and matches rows for the table on the right side of the join.

In [54]:
%%sql SELECT *
FROM Worker
LEFT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///practice.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR', 1, 4500, '16-02-20'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR', 1, 5000, '16-02-20'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin', 2, 3000, '16-06-11'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin', 2, 3500, '16-06-11'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR', 3, 4000, '16-02-20'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin', None, None, None),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin', None, None, None),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account', None, None, None),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account', None, None, None),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin', None, None, None)]

In [55]:
%%sql SELECT *
FROM Bonus
LEFT JOIN Worker ON Bonus.WORKER_REF_ID = Worker.WORKER_ID;

 * sqlite:///practice.db
Done.

[(1, 5000, '16-02-20', 1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 3000, '16-06-11', 2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 4000, '16-02-20', 3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (1, 4500, '16-02-20', 1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 3500, '16-06-11', 2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin')]

**Right Join**

This join returns all the rows of the table on the right side of the join and matching rows for the table on the left side of the join

In [56]:
%%sql SELECT *
FROM Worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///practice.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *
FROM Worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [57]:
%%sql SELECT *
FROM Bonus
RIGHT JOIN Worker ON Bonus.WORKER_REF_ID = Worker.WORKER_ID;

 * sqlite:///practice.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *
FROM Bonus
RIGHT JOIN Worker ON Bonus.WORKER_REF_ID = Worker.WORKER_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [58]:
%%sql SELECT *
FROM Worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///practice.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *
FROM Worker
RIGHT JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**Inner Join**

The INNER JOIN keyword selects all rows from both the tables as long as the condition is satisfied

In [59]:
# Inner Join

%%sql SELECT *
FROM Worker
INNER JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///practice.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR', 1, 5000, '16-02-20'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin', 2, 3000, '16-06-11'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR', 3, 4000, '16-02-20'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR', 1, 4500, '16-02-20'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin', 2, 3500, '16-06-11')]

**Full Join**

 The result-set will contain all the rows from both tables.

In [60]:
# Full JOIN

%%sql SELECT *
FROM Worker
FULL OUTER JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;

 * sqlite:///practice.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *
FROM Worker
FULL OUTER JOIN Bonus ON Worker.WORKER_ID = Bonus.WORKER_REF_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)